
'''
# 实战1：从键盘上获取一个4位整数，分别输出各位、十位、百位、千位上的数字
num = eval(input("输入一个4位数字："))
print("千位上的数字是：", num//1000)
print("百位上的数字是：", num%1000//100)
print("十位上的数字是：", num%100//10)
print("个位上的数字是：", num%10)
'''

'''
# 实战2：根据父母身高预测儿子身高；
# 公式：儿子身高=（父亲身高+母亲身高）*0.54
father = eval(input("输入父亲身高："))
mother = eval(input("输入母亲身高："))
print("儿子的身高是：", (father+mother)*0.54)
'''

# 实战3：寻找100-999之间的水仙花数
# 水仙花数：个位3次方+十位三次方+百位三次方=这个数本身
for num in range(100,1000):
    if (num//100)**3+(num%100//10)**3+(num%10)**3==num:
        print(num,'这是水仙花数')

print()

